Revit 2027 API
AnalyticalElementSelector Enumeration
 Specifies a portion of an Analytical Element or the whole element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum AnalyticalElementSelector
Public Enumeration AnalyticalElementSelector
public enum class AnalyticalElementSelector
type AnalyticalElementSelector
Members
Member name | Value | Description
EndOrTop | 1 |  End or top of element (corresponds to end = 1).
StartOrBase | 0 |  Start or base of element (corresponds to end = 0).
Whole | 2 |  Entire element
See Also
Reference
Autodesk.Revit.DB.Structure Namespace